
let iconList = {
    'наркотик': '<:narcotic:548123412178927617>',
    'стимулятор': '<:stimulant:571353357651017739>',
    'наркоберри': '<:narcoberry:548124577306509346>',
    'биотоксин': '<:bio_toxin:548124767450824705>',
    'металл': '<:Metal:582926207826526221>',

    /* Еда */
    'сыроемясо': '<:raw_meat:556061841885888513>',
    'жареноемясо': '<:cooked_meat:553204370435735552>',

    'сыраярыба': '<:Raw_Fish_Meat:587555714168389632>',
    'жаренаярыба': '<:cooked_fish_meat:553204985043615764>',

    'вяленоемясо': '<:cooked_meat_jerky:553205077431549967>',
    'вяленоепервосортноемясо': '<:prime_meat_jerky:553205638688407562>',

    'жареноемясоилижаренаярыба': '<:cooked_meat_or_cooked_fish_meat:572713747794362368>',

    'протухшеемясо': '<:spoiled_neat:556057206181855235>',


    'межоберри': '<:mejoberry:553204416904167425>',
    'амаберри': '<:amarberry:553204333915799552>',
    'азулберри': '<:azulberry:557878876097740811>',
    'тинтоберри': '<:tintoberry:553204467047202820>',
    'стимберри': '<:stimberry:571353357172604929>',
    'ягоды': '<:berries:556050971734704130>',

    'семенаамаберри': '<:amarberry_seed:556065769742663681>',

    'морковь': '<:rockarrot:553205175733583876>',
    'картофель': '<:savoroot:553205272651497483>',
    'кукуруза': '<:longrass:553205142615228417>',
    'лимон': '<:citronal:553205588213891073>',
    'семеналимона': '<:citronal_seed:556066130058412032>',
    'овощи': '<:vegetables:556049562981367828>',

    'острыйягодныйнастой': '<:focal_chili:553222613208399875>',
    'похлебкалазаря': '<:lazarus_chowder:553222831438168065>',
    'похлёбкалазаря': '<:lazarus_chowder:553222831438168065>',
    'сладкийовощнойкекс': '<:sweet_vegetable_cake:556051408986832902>',

    'редкийгриб': '<:rare_mushroom:553205702714327043>',
    'редкийцветок': '<:rare_flower:553222870847717386>',
    'медгигантскойпчелы': '<:giant_bee_honey:553222776408768533>',
    'мёдгигантскойпчелы': '<:giant_bee_honey:553222776408768533>',
    'базовыйкорм': '<:basic_kibble:556045991724187648>',
    'простойкорм': '<:simple_kibble:556046211061121024>',
    'обычныйкорм': '<:regular_kibble:556046470826950676>',
    'отличныйкорм': '<:superior_kibble:556046701396230144>',
    'исключительныйкорм': '<:exceptional_kibble:556046877557129216>',
    'экстраординарныйкорм': '<:extraordinary_kibble:556047037003726851>',

    /* Предметы */
    'волокно': '<:fiber:553206363485110302>',
    'древесныйсок': '<:sap:553205747366887424>',
    'сера': '<:sulfur:556066436825481226>',
    'глина': '<:clay:556066746638008331>',
    'камень': '<:stone:556067241989505034>',
    'элемент': '<:element:556067937144799242>',
    'гельудильщика': '<:angler_gel:557202036282621953>',
    'кремень': '<:flint:571351559720665108>',
    'селитра': '<:sparkpowder:571351559292715008>',
    'вода': '<:water:571356871206895636>',
    'деревоилигрибнаядревесина': '<:wood_or_fungal_wood:571356872377106434>',
    'солома': '<:thatch:571356872007745547>',
    'нефть': '<:oil:571356872423243776>',
    'металлическийслитокилислитокизметаллолома': '<:metal_ingot_or_scrap_metal_ingot:571356871852818442>',
    'полимерорганическийполимерилипораженныйнарост': '<:Polymer_Organic_Polymer_or_Corru:606061907702710293>',
    'полимерорганическийполимерилипоражённыйнарост': '<:Polymer_Organic_Polymer_or_Corru:606061907702710293>',
    'кожа': '<:hide:571356873345728540>',
    'хитиниликератин': '<:chitin_or_keratin:571356872238432262>',
    'наркоберриилиедкийгриб': '<:Narcoberry_or_Ascerbic_Mushroom:582926208317259786>',
    'черныйжемчуг': '<:Black_Pearl:606061908465811479>',
    'кристалл': '<:Crystal:606061903889825793>',
    'цементнаяпаста': '<:Cementing_Paste:606068133182046208>',
    'пастаахатины': '<:Cementing_Paste:606068133182046208>',
    'цементнаяпастаилипастаахатины': '<:Cementing_Paste:606068133182046208>',
    'электроника': '<:Electronics:606072166324109312>',
    'яйцо': '<:dinosaur_egg:553203871464292364>',
    'оченьмаленькоеяйцо': '<:dinosaur_egg:553203871464292364>',
    'маленькоеяйцо': '<:dinosaur_egg:553203871464292364>',
    'среднееяйцо': '<:dinosaur_egg:553203871464292364>',
    'большоеяйцо': '<:dinosaur_egg:553203871464292364>',
    'оченьбольшоеяйцо': '<:dinosaur_egg:553203871464292364>',
    'золотоеяйцогесперорниса': '<:golden_hesperornis_egg:553203954289344512>',
    'специальноеяйцо': '<:golden_hesperornis_egg:553203954289344512>',

    /* Станции */
    'котелок': '<:cooking_pot:572811121787142145>',
    'промышленнаяпечь': '<:industrial_cooker:572811122361761812>',
    'станцияшеф-повара': '<:chef_station_mobile:572811763247218689>',
    'инвентарь': '<:Weight:582926207075614760>',
    'ступкаипестик': '<:Mortar_And_Pestle:582926207922864190>',
    'химическийстол': '<:Chemistry_Bench:582926208791216128>',
    'седлодляэквуса': '<:Equus_Saddle:582926207985647646>',
    'верстак': '<:Smithy:582926208048562185>',
    'седлодляаргентависа': '<:Argentavis_Saddle:582926208090505229>',
    'седлодлякастороидеса': '<:Castoroides_Saddle:582926208493420544>',
    'седлодляшипастогодракона': '<:Thorny_Dragon_Saddle_Scorched_Ea:582926208015138836>',
    'текрепликатор': '<:Tek_Replicator:582926208157876234>',
    'обелиск': '<:Obelisk:606061908352696320>',
    'маяк': '<:Purple_Beacon:606062202436321280>',
    'станок': '<:Fabricator:606072166043353088>',

    /* Корма */
    'корм': '<:kibble:582920267995676673>',
};


module.exports = (text) => {
    text = text.toLowerCase().replace(/(\s|,)/g, '').replace(/ё/g, 'е');
    if(iconList[text]) {
        return iconList[text]+' ';
    }
    return '';
};
